// -----// IR Dump After CheckVHLOStableHloMixUsage (iree-check-vhlostablehlo-mix-usage) //----- //
module {
  func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<1x784xf32>
    %1 = stablehlo.dot %0, %arg1 : (tensor<1x784xf32>, tensor<784x10xf32>) -> tensor<1x10xf32>
    %2 = stablehlo.add %1, %arg2 : tensor<1x10xf32>
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
    %3 = stablehlo.maximum %2, %cst : tensor<1x10xf32>
    return %3 : tensor<1x10xf32>
  }
}


// -----// IR Dump After VhloToVersionPass (vhlo-to-version) //----- //
module {
  func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<1x784xf32>
    %1 = stablehlo.dot %0, %arg1 : (tensor<1x784xf32>, tensor<784x10xf32>) -> tensor<1x10xf32>
    %2 = stablehlo.add %1, %arg2 : tensor<1x10xf32>
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
    %3 = stablehlo.maximum %2, %cst : tensor<1x10xf32>
    return %3 : tensor<1x10xf32>
  }
}


// -----// IR Dump After VhloLegalizeToStablehloPass (vhlo-legalize-to-stablehlo) //----- //
module {
  func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<1x784xf32>
    %1 = stablehlo.dot %0, %arg1 : (tensor<1x784xf32>, tensor<784x10xf32>) -> tensor<1x10xf32>
    %2 = stablehlo.add %1, %arg2 : tensor<1x10xf32>
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
    %3 = stablehlo.maximum %2, %cst : tensor<1x10xf32>
    return %3 : tensor<1x10xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
  %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<1x784xf32>
  %1 = stablehlo.dot %0, %arg1 : (tensor<1x784xf32>, tensor<784x10xf32>) -> tensor<1x10xf32>
  %2 = stablehlo.add %1, %arg2 : tensor<1x10xf32>
  %3 = stablehlo.maximum %2, %cst : tensor<1x10xf32>
  return %3 : tensor<1x10xf32>
}

// -----// IR Dump After StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
  %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<1x784xf32>
  %1 = stablehlo.dot %0, %arg1 : (tensor<1x784xf32>, tensor<784x10xf32>) -> tensor<1x10xf32>
  %2 = stablehlo.add %1, %arg2 : tensor<1x10xf32>
  %3 = stablehlo.maximum %2, %cst : tensor<1x10xf32>
  return %3 : tensor<1x10xf32>
}

// -----// IR Dump After CSE (cse) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
  %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<1x784xf32>
  %1 = stablehlo.dot %0, %arg1 : (tensor<1x784xf32>, tensor<784x10xf32>) -> tensor<1x10xf32>
  %2 = stablehlo.add %1, %arg2 : tensor<1x10xf32>
  %3 = stablehlo.maximum %2, %cst : tensor<1x10xf32>
  return %3 : tensor<1x10xf32>
}

// -----// IR Dump After LegalizeStableHLOCustomCalls (iree-stablehlo-legalize-custom-calls) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
  %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<1x784xf32>
  %1 = stablehlo.dot %0, %arg1 : (tensor<1x784xf32>, tensor<784x10xf32>) -> tensor<1x10xf32>
  %2 = stablehlo.add %1, %arg2 : tensor<1x10xf32>
  %3 = stablehlo.maximum %2, %cst : tensor<1x10xf32>
  return %3 : tensor<1x10xf32>
}

// -----// IR Dump After LegalizeControlFlow (iree-stablehlo-legalize-control-flow) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
  %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<1x784xf32>
  %1 = stablehlo.dot %0, %arg1 : (tensor<1x784xf32>, tensor<784x10xf32>) -> tensor<1x10xf32>
  %2 = stablehlo.add %1, %arg2 : tensor<1x10xf32>
  %3 = stablehlo.maximum %2, %cst : tensor<1x10xf32>
  return %3 : tensor<1x10xf32>
}

// -----// IR Dump After FlattenTuplesInSCF (iree-stablehlo-preprocessing-flatten-scf-tuples) //----- //
module {
  func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
    %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<1x784xf32>
    %1 = stablehlo.dot %0, %arg1 : (tensor<1x784xf32>, tensor<784x10xf32>) -> tensor<1x10xf32>
    %2 = stablehlo.add %1, %arg2 : tensor<1x10xf32>
    %3 = stablehlo.maximum %2, %cst : tensor<1x10xf32>
    return %3 : tensor<1x10xf32>
  }
}

=======================================================================================================
// -----// IR Dump After StableHLOToStableHLOPreprocessing (iree-stablehlo-to-stablehlo-preprocessing) //----- //
module {
  func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
    %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<784xf32>
    %1 = stablehlo.dot %0, %arg1 : (tensor<784xf32>, tensor<784x10xf32>) -> tensor<10xf32>
    %2 = stablehlo.reshape %1 : (tensor<10xf32>) -> tensor<1x10xf32>
    %3 = stablehlo.add %2, %arg2 : tensor<1x10xf32>
    %4 = stablehlo.maximum %3, %cst : tensor<1x10xf32>
    return %4 : tensor<1x10xf32>
  }
}


// -----// IR Dump After StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
  %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<784xf32>
  %1 = stablehlo.dot %0, %arg1 : (tensor<784xf32>, tensor<784x10xf32>) -> tensor<10xf32>
  %2 = stablehlo.reshape %1 : (tensor<10xf32>) -> tensor<1x10xf32>
  %3 = stablehlo.add %2, %arg2 : tensor<1x10xf32>
  %4 = stablehlo.maximum %3, %cst : tensor<1x10xf32>
  return %4 : tensor<1x10xf32>
}

// -----// IR Dump After ShapeToShapeLowering (shape-to-shape-lowering) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
  %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<784xf32>
  %1 = stablehlo.dot %0, %arg1 : (tensor<784xf32>, tensor<784x10xf32>) -> tensor<10xf32>
  %2 = stablehlo.reshape %1 : (tensor<10xf32>) -> tensor<1x10xf32>
  %3 = stablehlo.add %2, %arg2 : tensor<1x10xf32>
  %4 = stablehlo.maximum %3, %cst : tensor<1x10xf32>
  return %4 : tensor<1x10xf32>
}

=======================================================================================================
// -----// IR Dump After ConvertShapeToStandard (convert-shape-to-std) //----- //
module {
  func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
    %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<784xf32>
    %1 = stablehlo.dot %0, %arg1 : (tensor<784xf32>, tensor<784x10xf32>) -> tensor<10xf32>
    %2 = stablehlo.reshape %1 : (tensor<10xf32>) -> tensor<1x10xf32>
    %3 = stablehlo.add %2, %arg2 : tensor<1x10xf32>
    %4 = stablehlo.maximum %3, %cst : tensor<1x10xf32>
    return %4 : tensor<1x10xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
  %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<784xf32>
  %1 = stablehlo.dot %0, %arg1 : (tensor<784xf32>, tensor<784x10xf32>) -> tensor<10xf32>
  %2 = stablehlo.reshape %1 : (tensor<10xf32>) -> tensor<1x10xf32>
  %3 = stablehlo.add %2, %arg2 : tensor<1x10xf32>
  %4 = stablehlo.maximum %3, %cst : tensor<1x10xf32>
  return %4 : tensor<1x10xf32>
}

// -----// IR Dump After StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
  %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<784xf32>
  %1 = stablehlo.dot %0, %arg1 : (tensor<784xf32>, tensor<784x10xf32>) -> tensor<10xf32>
  %2 = stablehlo.reshape %1 : (tensor<10xf32>) -> tensor<1x10xf32>
  %3 = stablehlo.add %2, %arg2 : tensor<1x10xf32>
  %4 = stablehlo.maximum %3, %cst : tensor<1x10xf32>
  return %4 : tensor<1x10xf32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
  %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<784xf32>
  %1 = stablehlo.dot %0, %arg1 : (tensor<784xf32>, tensor<784x10xf32>) -> tensor<10xf32>
  %2 = stablehlo.reshape %1 : (tensor<10xf32>) -> tensor<1x10xf32>
  %3 = stablehlo.add %2, %arg2 : tensor<1x10xf32>
  %4 = stablehlo.maximum %3, %cst : tensor<1x10xf32>
  return %4 : tensor<1x10xf32>
}

// -----// IR Dump After Inliner (inline) //----- //
module {
  func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
    %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<784xf32>
    %1 = stablehlo.dot %0, %arg1 : (tensor<784xf32>, tensor<784x10xf32>) -> tensor<10xf32>
    %2 = stablehlo.reshape %1 : (tensor<10xf32>) -> tensor<1x10xf32>
    %3 = stablehlo.add %2, %arg2 : tensor<1x10xf32>
    %4 = stablehlo.maximum %3, %cst : tensor<1x10xf32>
    return %4 : tensor<1x10xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
  %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<784xf32>
  %1 = stablehlo.dot %0, %arg1 : (tensor<784xf32>, tensor<784x10xf32>) -> tensor<10xf32>
  %2 = stablehlo.reshape %1 : (tensor<10xf32>) -> tensor<1x10xf32>
  %3 = stablehlo.add %2, %arg2 : tensor<1x10xf32>
  %4 = stablehlo.maximum %3, %cst : tensor<1x10xf32>
  return %4 : tensor<1x10xf32>
}

// -----// IR Dump After StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
  %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<784xf32>
  %1 = stablehlo.dot %0, %arg1 : (tensor<784xf32>, tensor<784x10xf32>) -> tensor<10xf32>
  %2 = stablehlo.reshape %1 : (tensor<10xf32>) -> tensor<1x10xf32>
  %3 = stablehlo.add %2, %arg2 : tensor<1x10xf32>
  %4 = stablehlo.maximum %3, %cst : tensor<1x10xf32>
  return %4 : tensor<1x10xf32>
}

// -----// IR Dump After CSE (cse) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
  %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<784xf32>
  %1 = stablehlo.dot %0, %arg1 : (tensor<784xf32>, tensor<784x10xf32>) -> tensor<10xf32>
  %2 = stablehlo.reshape %1 : (tensor<10xf32>) -> tensor<1x10xf32>
  %3 = stablehlo.add %2, %arg2 : tensor<1x10xf32>
  %4 = stablehlo.maximum %3, %cst : tensor<1x10xf32>
  return %4 : tensor<1x10xf32>
}

// -----// IR Dump After LegalizeShapeComputations (iree-stablehlo-legalize-shape-computations) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
  %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<784xf32>
  %1 = stablehlo.dot %0, %arg1 : (tensor<784xf32>, tensor<784x10xf32>) -> tensor<10xf32>
  %2 = stablehlo.reshape %1 : (tensor<10xf32>) -> tensor<1x10xf32>
  %3 = stablehlo.add %2, %arg2 : tensor<1x10xf32>
  %4 = stablehlo.maximum %3, %cst : tensor<1x10xf32>
  return %4 : tensor<1x10xf32>
}

=======================================================================================================
// -----// IR Dump After ConvertStableHloToLinalgExt (iree-stablehlo-to-linalg-ext) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
  %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<784xf32>
  %1 = stablehlo.dot %0, %arg1 : (tensor<784xf32>, tensor<784x10xf32>) -> tensor<10xf32>
  %2 = stablehlo.reshape %1 : (tensor<10xf32>) -> tensor<1x10xf32>
  %3 = stablehlo.add %2, %arg2 : tensor<1x10xf32>
  %4 = stablehlo.maximum %3, %cst : tensor<1x10xf32>
  return %4 : tensor<1x10xf32>
}

// -----// IR Dump After LegalizeChlo (iree-stablehlo-legalize-chlo) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = stablehlo.constant dense<0.000000e+00> : tensor<1x10xf32>
  %0 = stablehlo.reshape %arg0 : (tensor<28x28xf32>) -> tensor<784xf32>
  %1 = stablehlo.dot %0, %arg1 : (tensor<784xf32>, tensor<784x10xf32>) -> tensor<10xf32>
  %2 = stablehlo.reshape %1 : (tensor<10xf32>) -> tensor<1x10xf32>
  %3 = stablehlo.add %2, %arg2 : tensor<1x10xf32>
  %4 = stablehlo.maximum %3, %cst : tensor<1x10xf32>
  return %4 : tensor<1x10xf32>
}

=======================================================================================================
=================================== 将StableHLO转到Linalg On Tensor ===================================
// -----// IR Dump After ConvertStableHloToIreeInputDialects (iree-stablehlo-to-iree-input) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %cst_0 = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
    %collapsed = tensor.collapse_shape %arg0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
    %0 = tensor.empty() : tensor<10xf32>
    %1 = linalg.fill ins(%cst : f32) outs(%0 : tensor<10xf32>) -> tensor<10xf32>
    %2 = linalg.vecmat ins(%collapsed, %arg1 : tensor<784xf32>, tensor<784x10xf32>) outs(%1 : tensor<10xf32>) -> tensor<10xf32>
    %expanded = tensor.expand_shape %2 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
    %3 = tensor.empty() : tensor<1x10xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%expanded, %arg2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%3 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.addf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    %5 = tensor.empty() : tensor<1x10xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %cst_0 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%5 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.maximumf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    return %6 : tensor<1x10xf32>
  }
}

=======================================================================================================
// -----// IR Dump After ReconcileUnrealizedCasts (reconcile-unrealized-casts) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %cst_0 = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
    %collapsed = tensor.collapse_shape %arg0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
    %0 = tensor.empty() : tensor<10xf32>
    %1 = linalg.fill ins(%cst : f32) outs(%0 : tensor<10xf32>) -> tensor<10xf32>
    %2 = linalg.vecmat ins(%collapsed, %arg1 : tensor<784xf32>, tensor<784x10xf32>) outs(%1 : tensor<10xf32>) -> tensor<10xf32>
    %expanded = tensor.expand_shape %2 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
    %3 = tensor.empty() : tensor<1x10xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%expanded, %arg2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%3 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.addf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    %5 = tensor.empty() : tensor<1x10xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %cst_0 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%5 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.maximumf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    return %6 : tensor<1x10xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = arith.constant 0.000000e+00 : f32
  %cst_0 = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
  %collapsed = tensor.collapse_shape %arg0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
  %0 = tensor.empty() : tensor<10xf32>
  %1 = linalg.fill ins(%cst : f32) outs(%0 : tensor<10xf32>) -> tensor<10xf32>
  %2 = linalg.vecmat ins(%collapsed, %arg1 : tensor<784xf32>, tensor<784x10xf32>) outs(%1 : tensor<10xf32>) -> tensor<10xf32>
  %expanded = tensor.expand_shape %2 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
  %3 = tensor.empty() : tensor<1x10xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%expanded, %arg2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%3 : tensor<1x10xf32>) {
  ^bb0(%in: f32, %in_1: f32, %out: f32):
    %7 = arith.addf %in, %in_1 : f32
    linalg.yield %7 : f32
  } -> tensor<1x10xf32>
  %5 = tensor.empty() : tensor<1x10xf32>
  %6 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%4, %cst_0 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%5 : tensor<1x10xf32>) {
  ^bb0(%in: f32, %in_1: f32, %out: f32):
    %7 = arith.maximumf %in, %in_1 : f32
    linalg.yield %7 : f32
  } -> tensor<1x10xf32>
  return %6 : tensor<1x10xf32>
}

// -----// IR Dump After StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = arith.constant 0.000000e+00 : f32
  %cst_0 = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
  %collapsed = tensor.collapse_shape %arg0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
  %0 = tensor.empty() : tensor<10xf32>
  %1 = linalg.fill ins(%cst : f32) outs(%0 : tensor<10xf32>) -> tensor<10xf32>
  %2 = linalg.vecmat ins(%collapsed, %arg1 : tensor<784xf32>, tensor<784x10xf32>) outs(%1 : tensor<10xf32>) -> tensor<10xf32>
  %expanded = tensor.expand_shape %2 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
  %3 = tensor.empty() : tensor<1x10xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%expanded, %arg2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%3 : tensor<1x10xf32>) {
  ^bb0(%in: f32, %in_1: f32, %out: f32):
    %7 = arith.addf %in, %in_1 : f32
    linalg.yield %7 : f32
  } -> tensor<1x10xf32>
  %5 = tensor.empty() : tensor<1x10xf32>
  %6 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%4, %cst_0 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%5 : tensor<1x10xf32>) {
  ^bb0(%in: f32, %in_1: f32, %out: f32):
    %7 = arith.maximumf %in, %in_1 : f32
    linalg.yield %7 : f32
  } -> tensor<1x10xf32>
  return %6 : tensor<1x10xf32>
}

// -----// IR Dump After VerifyCompilerStableHloInputLegality (iree-stablehlo-verify-compiler-input-legality) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %cst_0 = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
    %collapsed = tensor.collapse_shape %arg0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
    %0 = tensor.empty() : tensor<10xf32>
    %1 = linalg.fill ins(%cst : f32) outs(%0 : tensor<10xf32>) -> tensor<10xf32>
    %2 = linalg.vecmat ins(%collapsed, %arg1 : tensor<784xf32>, tensor<784x10xf32>) outs(%1 : tensor<10xf32>) -> tensor<10xf32>
    %expanded = tensor.expand_shape %2 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
    %3 = tensor.empty() : tensor<1x10xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%expanded, %arg2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%3 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.addf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    %5 = tensor.empty() : tensor<1x10xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %cst_0 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%5 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.maximumf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    return %6 : tensor<1x10xf32>
  }
}

=======================================================================================================
// -----// IR Dump After IREEImportPublicPass (iree-import-public) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %cst_0 = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
    %collapsed = tensor.collapse_shape %arg0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
    %0 = tensor.empty() : tensor<10xf32>
    %1 = linalg.fill ins(%cst : f32) outs(%0 : tensor<10xf32>) -> tensor<10xf32>
    %2 = linalg.vecmat ins(%collapsed, %arg1 : tensor<784xf32>, tensor<784x10xf32>) outs(%1 : tensor<10xf32>) -> tensor<10xf32>
    %expanded = tensor.expand_shape %2 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
    %3 = tensor.empty() : tensor<1x10xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%expanded, %arg2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%3 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.addf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    %5 = tensor.empty() : tensor<1x10xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %cst_0 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%5 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.maximumf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    util.return %6 : tensor<1x10xf32>
  }
}

=======================================================================================================
// -----// IR Dump After ImportMLProgramPass (iree-import-ml-program) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %cst_0 = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
    %collapsed = tensor.collapse_shape %arg0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
    %0 = tensor.empty() : tensor<10xf32>
    %1 = linalg.fill ins(%cst : f32) outs(%0 : tensor<10xf32>) -> tensor<10xf32>
    %2 = linalg.vecmat ins(%collapsed, %arg1 : tensor<784xf32>, tensor<784x10xf32>) outs(%1 : tensor<10xf32>) -> tensor<10xf32>
    %expanded = tensor.expand_shape %2 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
    %3 = tensor.empty() : tensor<1x10xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%expanded, %arg2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%3 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.addf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    %5 = tensor.empty() : tensor<1x10xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %cst_0 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%5 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.maximumf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    util.return %6 : tensor<1x10xf32>
  }
}


// -----// IR Dump After SanitizeModuleNamesPass (iree-sanitize-module-names) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %cst_0 = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
    %collapsed = tensor.collapse_shape %arg0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
    %0 = tensor.empty() : tensor<10xf32>
    %1 = linalg.fill ins(%cst : f32) outs(%0 : tensor<10xf32>) -> tensor<10xf32>
    %2 = linalg.vecmat ins(%collapsed, %arg1 : tensor<784xf32>, tensor<784x10xf32>) outs(%1 : tensor<10xf32>) -> tensor<10xf32>
    %expanded = tensor.expand_shape %2 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
    %3 = tensor.empty() : tensor<1x10xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%expanded, %arg2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%3 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.addf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    %5 = tensor.empty() : tensor<1x10xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %cst_0 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%5 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.maximumf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    util.return %6 : tensor<1x10xf32>
  }
}


// -----// IR Dump After ConvertMeshToFlowPass (iree-convert-mesh-to-flow) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %cst_0 = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
    %collapsed = tensor.collapse_shape %arg0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
    %0 = tensor.empty() : tensor<10xf32>
    %1 = linalg.fill ins(%cst : f32) outs(%0 : tensor<10xf32>) -> tensor<10xf32>
    %2 = linalg.vecmat ins(%collapsed, %arg1 : tensor<784xf32>, tensor<784x10xf32>) outs(%1 : tensor<10xf32>) -> tensor<10xf32>
    %expanded = tensor.expand_shape %2 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
    %3 = tensor.empty() : tensor<1x10xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%expanded, %arg2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%3 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.addf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    %5 = tensor.empty() : tensor<1x10xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %cst_0 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%5 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.maximumf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    util.return %6 : tensor<1x10xf32>
  }
}

==============================================================================================================
// -----// IR Dump After DemoteF64ToF32Pass (iree-input-conversion-demote-f64-to-f32) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %cst_0 = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
    %collapsed = tensor.collapse_shape %arg0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
    %0 = tensor.empty() : tensor<10xf32>
    %1 = linalg.fill ins(%cst : f32) outs(%0 : tensor<10xf32>) -> tensor<10xf32>
    %2 = linalg.vecmat ins(%collapsed, %arg1 : tensor<784xf32>, tensor<784x10xf32>) outs(%1 : tensor<10xf32>) -> tensor<10xf32>
    %expanded = tensor.expand_shape %2 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
    %3 = tensor.empty() : tensor<1x10xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%expanded, %arg2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%3 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.addf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    %5 = tensor.empty() : tensor<1x10xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %cst_0 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%5 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.maximumf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    util.return %6 : tensor<1x10xf32>
  }
}


// -----// IR Dump After mlir::iree_compiler::IREE::ABI::ConvertStreamableOpsPass (iree-abi-convert-streamable-ops) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %cst_0 = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
    %collapsed = tensor.collapse_shape %arg0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
    %0 = tensor.empty() : tensor<10xf32>
    %1 = linalg.fill ins(%cst : f32) outs(%0 : tensor<10xf32>) -> tensor<10xf32>
    %2 = linalg.vecmat ins(%collapsed, %arg1 : tensor<784xf32>, tensor<784x10xf32>) outs(%1 : tensor<10xf32>) -> tensor<10xf32>
    %expanded = tensor.expand_shape %2 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
    %3 = tensor.empty() : tensor<1x10xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%expanded, %arg2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%3 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.addf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    %5 = tensor.empty() : tensor<1x10xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %cst_0 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%5 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.maximumf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    util.return %6 : tensor<1x10xf32>
  }
}

=======================================================================================================
// -----// IR Dump After mlir::iree_compiler::IREE::ABI::WrapEntryPointsPass (iree-abi-wrap-entry-points) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @main(%input0: tensor<28x28xf32>, %input1: tensor<784x10xf32>, %input2: tensor<1x10xf32>) -> (%output0: tensor<1x10xf32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<28x28xf32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<784x10xf32>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<1x10xf32>
    %3 = util.call @_main(%0, %1, %2) : (tensor<28x28xf32>, tensor<784x10xf32>, tensor<1x10xf32>) -> tensor<1x10xf32>
    %4 = hal.tensor.export %3 "output0" : tensor<1x10xf32> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
  util.func private @_main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %cst_0 = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
    %collapsed = tensor.collapse_shape %arg0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
    %0 = tensor.empty() : tensor<10xf32>
    %1 = linalg.fill ins(%cst : f32) outs(%0 : tensor<10xf32>) -> tensor<10xf32>
    %2 = linalg.vecmat ins(%collapsed, %arg1 : tensor<784xf32>, tensor<784x10xf32>) outs(%1 : tensor<10xf32>) -> tensor<10xf32>
    %expanded = tensor.expand_shape %2 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
    %3 = tensor.empty() : tensor<1x10xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%expanded, %arg2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%3 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.addf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    %5 = tensor.empty() : tensor<1x10xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %cst_0 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%5 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %7 = arith.maximumf %in, %in_1 : f32
      linalg.yield %7 : f32
    } -> tensor<1x10xf32>
    util.return %6 : tensor<1x10xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func private @_main(%arg0: tensor<28x28xf32>, %arg1: tensor<784x10xf32>, %arg2: tensor<1x10xf32>) -> tensor<1x10xf32> {
  %cst = arith.constant 0.000000e+00 : f32
  %cst_0 = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
  %collapsed = tensor.collapse_shape %arg0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
  %0 = tensor.empty() : tensor<10xf32>
  %1 = linalg.fill ins(%cst : f32) outs(%0 : tensor<10xf32>) -> tensor<10xf32>
  %2 = linalg.vecmat ins(%collapsed, %arg1 : tensor<784xf32>, tensor<784x10xf32>) outs(%1 : tensor<10xf32>) -> tensor<10xf32>
  %expanded = tensor.expand_shape %2 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
  %3 = tensor.empty() : tensor<1x10xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%expanded, %arg2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%3 : tensor<1x10xf32>) {
  ^bb0(%in: f32, %in_1: f32, %out: f32):
    %7 = arith.addf %in, %in_1 : f32
    linalg.yield %7 : f32
  } -> tensor<1x10xf32>
  %5 = tensor.empty() : tensor<1x10xf32>
  %6 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%4, %cst_0 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%5 : tensor<1x10xf32>) {
  ^bb0(%in: f32, %in_1: f32, %out: f32):
    %7 = arith.maximumf %in, %in_1 : f32
    linalg.yield %7 : f32
  } -> tensor<1x10xf32>
  util.return %6 : tensor<1x10xf32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func public @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @main(%input0: tensor<28x28xf32>, %input1: tensor<784x10xf32>, %input2: tensor<1x10xf32>) -> (%output0: tensor<1x10xf32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<28x28xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<784x10xf32>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<1x10xf32>
  %3 = util.call @_main(%0, %1, %2) : (tensor<28x28xf32>, tensor<784x10xf32>, tensor<1x10xf32>) -> tensor<1x10xf32>
  %4 = hal.tensor.export %3 "output0" : tensor<1x10xf32> -> !hal.buffer_view
  util.return %4 : !hal.buffer_view
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func public @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @main(%input0: tensor<28x28xf32>, %input1: tensor<784x10xf32>, %input2: tensor<1x10xf32>) -> (%output0: tensor<1x10xf32>)"}} {
  %cst = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
  %cst_0 = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<28x28xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<784x10xf32>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<1x10xf32>
  %collapsed = tensor.collapse_shape %0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
  %3 = tensor.empty() : tensor<10xf32>
  %4 = linalg.fill ins(%cst_0 : f32) outs(%3 : tensor<10xf32>) -> tensor<10xf32>
  %5 = linalg.vecmat ins(%collapsed, %1 : tensor<784xf32>, tensor<784x10xf32>) outs(%4 : tensor<10xf32>) -> tensor<10xf32>
  %expanded = tensor.expand_shape %5 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
  %6 = tensor.empty() : tensor<1x10xf32>
  %7 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%expanded, %2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%6 : tensor<1x10xf32>) {
  ^bb0(%in: f32, %in_1: f32, %out: f32):
    %11 = arith.addf %in, %in_1 : f32
    linalg.yield %11 : f32
  } -> tensor<1x10xf32>
  %8 = tensor.empty() : tensor<1x10xf32>
  %9 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%7, %cst : tensor<1x10xf32>, tensor<1x10xf32>) outs(%8 : tensor<1x10xf32>) {
  ^bb0(%in: f32, %in_1: f32, %out: f32):
    %11 = arith.maximumf %in, %in_1 : f32
    linalg.yield %11 : f32
  } -> tensor<1x10xf32>
  %10 = hal.tensor.export %9 "output0" : tensor<1x10xf32> -> !hal.buffer_view
  util.return %10 : !hal.buffer_view
}

// -----// IR Dump After Inliner (inline) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @main(%input0: tensor<28x28xf32>, %input1: tensor<784x10xf32>, %input2: tensor<1x10xf32>) -> (%output0: tensor<1x10xf32>)"}} {
    %cst = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
    %cst_0 = arith.constant 0.000000e+00 : f32
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<28x28xf32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<784x10xf32>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<1x10xf32>
    %collapsed = tensor.collapse_shape %0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
    %3 = tensor.empty() : tensor<10xf32>
    %4 = linalg.fill ins(%cst_0 : f32) outs(%3 : tensor<10xf32>) -> tensor<10xf32>
    %5 = linalg.vecmat ins(%collapsed, %1 : tensor<784xf32>, tensor<784x10xf32>) outs(%4 : tensor<10xf32>) -> tensor<10xf32>
    %expanded = tensor.expand_shape %5 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
    %6 = tensor.empty() : tensor<1x10xf32>
    %7 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%expanded, %2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%6 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %11 = arith.addf %in, %in_1 : f32
      linalg.yield %11 : f32
    } -> tensor<1x10xf32>
    %8 = tensor.empty() : tensor<1x10xf32>
    %9 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%7, %cst : tensor<1x10xf32>, tensor<1x10xf32>) outs(%8 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %11 = arith.maximumf %in, %in_1 : f32
      linalg.yield %11 : f32
    } -> tensor<1x10xf32>
    %10 = hal.tensor.export %9 "output0" : tensor<1x10xf32> -> !hal.buffer_view
    util.return %10 : !hal.buffer_view
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func public @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @main(%input0: tensor<28x28xf32>, %input1: tensor<784x10xf32>, %input2: tensor<1x10xf32>) -> (%output0: tensor<1x10xf32>)"}} {
  %cst = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
  %cst_0 = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<28x28xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<784x10xf32>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<1x10xf32>
  %collapsed = tensor.collapse_shape %0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
  %3 = tensor.empty() : tensor<10xf32>
  %4 = linalg.fill ins(%cst_0 : f32) outs(%3 : tensor<10xf32>) -> tensor<10xf32>
  %5 = linalg.vecmat ins(%collapsed, %1 : tensor<784xf32>, tensor<784x10xf32>) outs(%4 : tensor<10xf32>) -> tensor<10xf32>
  %expanded = tensor.expand_shape %5 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
  %6 = tensor.empty() : tensor<1x10xf32>
  %7 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%expanded, %2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%6 : tensor<1x10xf32>) {
  ^bb0(%in: f32, %in_1: f32, %out: f32):
    %11 = arith.addf %in, %in_1 : f32
    linalg.yield %11 : f32
  } -> tensor<1x10xf32>
  %8 = tensor.empty() : tensor<1x10xf32>
  %9 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%7, %cst : tensor<1x10xf32>, tensor<1x10xf32>) outs(%8 : tensor<1x10xf32>) {
  ^bb0(%in: f32, %in_1: f32, %out: f32):
    %11 = arith.maximumf %in, %in_1 : f32
    linalg.yield %11 : f32
  } -> tensor<1x10xf32>
  %10 = hal.tensor.export %9 "output0" : tensor<1x10xf32> -> !hal.buffer_view
  util.return %10 : !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
util.func public @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @main(%input0: tensor<28x28xf32>, %input1: tensor<784x10xf32>, %input2: tensor<1x10xf32>) -> (%output0: tensor<1x10xf32>)"}} {
  %cst = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
  %cst_0 = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<28x28xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<784x10xf32>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<1x10xf32>
  %collapsed = tensor.collapse_shape %0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
  %3 = tensor.empty() : tensor<10xf32>
  %4 = linalg.fill ins(%cst_0 : f32) outs(%3 : tensor<10xf32>) -> tensor<10xf32>
  %5 = linalg.vecmat ins(%collapsed, %1 : tensor<784xf32>, tensor<784x10xf32>) outs(%4 : tensor<10xf32>) -> tensor<10xf32>
  %expanded = tensor.expand_shape %5 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
  %6 = tensor.empty() : tensor<1x10xf32>
  %7 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%expanded, %2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%6 : tensor<1x10xf32>) {
  ^bb0(%in: f32, %in_1: f32, %out: f32):
    %10 = arith.addf %in, %in_1 : f32
    linalg.yield %10 : f32
  } -> tensor<1x10xf32>
  %8 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%7, %cst : tensor<1x10xf32>, tensor<1x10xf32>) outs(%6 : tensor<1x10xf32>) {
  ^bb0(%in: f32, %in_1: f32, %out: f32):
    %10 = arith.maximumf %in, %in_1 : f32
    linalg.yield %10 : f32
  } -> tensor<1x10xf32>
  %9 = hal.tensor.export %8 "output0" : tensor<1x10xf32> -> !hal.buffer_view
  util.return %9 : !hal.buffer_view
}

// -----// IR Dump After SymbolDCE (symbol-dce) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @main(%input0: tensor<28x28xf32>, %input1: tensor<784x10xf32>, %input2: tensor<1x10xf32>) -> (%output0: tensor<1x10xf32>)"}} {
    %cst = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
    %cst_0 = arith.constant 0.000000e+00 : f32
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<28x28xf32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<784x10xf32>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<1x10xf32>
    %collapsed = tensor.collapse_shape %0 [[0, 1]] : tensor<28x28xf32> into tensor<784xf32>
    %3 = tensor.empty() : tensor<10xf32>
    %4 = linalg.fill ins(%cst_0 : f32) outs(%3 : tensor<10xf32>) -> tensor<10xf32>
    %5 = linalg.vecmat ins(%collapsed, %1 : tensor<784xf32>, tensor<784x10xf32>) outs(%4 : tensor<10xf32>) -> tensor<10xf32>
    %expanded = tensor.expand_shape %5 [[0, 1]] output_shape [1, 10] : tensor<10xf32> into tensor<1x10xf32>
    %6 = tensor.empty() : tensor<1x10xf32>
    %7 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%expanded, %2 : tensor<1x10xf32>, tensor<1x10xf32>) outs(%6 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %10 = arith.addf %in, %in_1 : f32
      linalg.yield %10 : f32
    } -> tensor<1x10xf32>
    %8 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%7, %cst : tensor<1x10xf32>, tensor<1x10xf32>) outs(%6 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %10 = arith.maximumf %in, %in_1 : f32
      linalg.yield %10 : f32
    } -> tensor<1x10xf32>
    %9 = hal.tensor.export %8 "output0" : tensor<1x10xf32> -> !hal.buffer_view
    util.return %9 : !hal.buffer_view
  }
}


// -----// IR Dump After AssignLegacyTargetDevicesPass (iree-hal-assign-legacy-target-devices) //----- //
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#map = affine_map<(d0, d1) -> (d0, d1)>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {hal.device.targets = [#device_target_cuda]} {
  util.func public @main(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @main(%input0: tensor<28x28xf32>, %input1: tensor<784x10xf32>, %input2: tensor<1x10xf32>) -> (%output0: tensor<1x10xf32>)"}} {
    %cst = arith.constant dense<0.000000e+00> : tensor<1x10xf32>
