// -----// IR Dump After CheckVHLOStableHloMixUsage (iree-check-vhlostablehlo-mix-usage) //----- //
module {
  func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
    return %0 : tensor<3x9xi32>
  }
}


// -----// IR Dump After VhloToVersionPass (vhlo-to-version) //----- //
module {
  func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
    return %0 : tensor<3x9xi32>
  }
}


// -----// IR Dump After VhloLegalizeToStablehloPass (vhlo-legalize-to-stablehlo) //----- //
module {
  func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
    return %0 : tensor<3x9xi32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  return %0 : tensor<3x9xi32>
}

// -----// IR Dump After StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  return %0 : tensor<3x9xi32>
}

// -----// IR Dump After CSE (cse) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  return %0 : tensor<3x9xi32>
}

// -----// IR Dump After LegalizeStableHLOCustomCalls (iree-stablehlo-legalize-custom-calls) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  return %0 : tensor<3x9xi32>
}

// -----// IR Dump After LegalizeControlFlow (iree-stablehlo-legalize-control-flow) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  return %0 : tensor<3x9xi32>
}

// -----// IR Dump After FlattenTuplesInSCF (iree-stablehlo-preprocessing-flatten-scf-tuples) //----- //
module {
  func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
    return %0 : tensor<3x9xi32>
  }
}


// -----// IR Dump After StableHLOToStableHLOPreprocessing (iree-stablehlo-to-stablehlo-preprocessing) //----- //
module {
  func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
    return %0 : tensor<3x9xi32>
  }
}


// -----// IR Dump After StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  return %0 : tensor<3x9xi32>
}

// -----// IR Dump After ShapeToShapeLowering (shape-to-shape-lowering) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  return %0 : tensor<3x9xi32>
}

// -----// IR Dump After ConvertShapeToStandard (convert-shape-to-std) //----- //
module {
  func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
    return %0 : tensor<3x9xi32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  return %0 : tensor<3x9xi32>
}

// -----// IR Dump After StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  return %0 : tensor<3x9xi32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  return %0 : tensor<3x9xi32>
}

// -----// IR Dump After Inliner (inline) //----- //
module {
  func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
    return %0 : tensor<3x9xi32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  return %0 : tensor<3x9xi32>
}

// -----// IR Dump After StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  return %0 : tensor<3x9xi32>
}

// -----// IR Dump After CSE (cse) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  return %0 : tensor<3x9xi32>
}

// -----// IR Dump After LegalizeShapeComputations (iree-stablehlo-legalize-shape-computations) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  return %0 : tensor<3x9xi32>
}

// -----// IR Dump After ConvertStableHloToLinalgExt (iree-stablehlo-to-linalg-ext) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  return %0 : tensor<3x9xi32>
}

// -----// IR Dump After LegalizeChlo (iree-stablehlo-legalize-chlo) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %0 = stablehlo.pad %arg0, %arg1, low = [0, 1], high = [1, 5], interior = [0, 0] : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  return %0 : tensor<3x9xi32>
}

// -----// IR Dump After ConvertStableHloToIreeInputDialects (iree-stablehlo-to-iree-input) //----- //
module {
  func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %extracted = tensor.extract %arg1[] : tensor<i32>
    %padded = tensor.pad %arg0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    return %padded : tensor<3x9xi32>
  }
}


// -----// IR Dump After ReconcileUnrealizedCasts (reconcile-unrealized-casts) //----- //
module {
  func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %extracted = tensor.extract %arg1[] : tensor<i32>
    %padded = tensor.pad %arg0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    return %padded : tensor<3x9xi32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %extracted = tensor.extract %arg1[] : tensor<i32>
  %padded = tensor.pad %arg0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  return %padded : tensor<3x9xi32>
}

// -----// IR Dump After StableHLOCanonicalize (iree-stablehlo-canonicalize) //----- //
func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %extracted = tensor.extract %arg1[] : tensor<i32>
  %padded = tensor.pad %arg0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  return %padded : tensor<3x9xi32>
}

// -----// IR Dump After VerifyCompilerStableHloInputLegality (iree-stablehlo-verify-compiler-input-legality) //----- //
module {
  func.func @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %extracted = tensor.extract %arg1[] : tensor<i32>
    %padded = tensor.pad %arg0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    return %padded : tensor<3x9xi32>
  }
}


// -----// IR Dump After IREEImportPublicPass (iree-import-public) //----- //
module {
  util.func public @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %extracted = tensor.extract %arg1[] : tensor<i32>
    %padded = tensor.pad %arg0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    util.return %padded : tensor<3x9xi32>
  }
}


// -----// IR Dump After ImportMLProgramPass (iree-import-ml-program) //----- //
module {
  util.func public @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %extracted = tensor.extract %arg1[] : tensor<i32>
    %padded = tensor.pad %arg0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    util.return %padded : tensor<3x9xi32>
  }
}


// -----// IR Dump After SanitizeModuleNamesPass (iree-sanitize-module-names) //----- //
module {
  util.func public @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %extracted = tensor.extract %arg1[] : tensor<i32>
    %padded = tensor.pad %arg0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    util.return %padded : tensor<3x9xi32>
  }
}


// -----// IR Dump After ConvertMeshToFlowPass (iree-convert-mesh-to-flow) //----- //
module {
  util.func public @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %extracted = tensor.extract %arg1[] : tensor<i32>
    %padded = tensor.pad %arg0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    util.return %padded : tensor<3x9xi32>
  }
}


// -----// IR Dump After DemoteF64ToF32Pass (iree-input-conversion-demote-f64-to-f32) //----- //
module {
  util.func public @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %extracted = tensor.extract %arg1[] : tensor<i32>
    %padded = tensor.pad %arg0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    util.return %padded : tensor<3x9xi32>
  }
}


// -----// IR Dump After mlir::iree_compiler::IREE::ABI::ConvertStreamableOpsPass (iree-abi-convert-streamable-ops) //----- //
module {
  util.func public @pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %extracted = tensor.extract %arg1[] : tensor<i32>
    %padded = tensor.pad %arg0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    util.return %padded : tensor<3x9xi32>
  }
}


// -----// IR Dump After mlir::iree_compiler::IREE::ABI::WrapEntryPointsPass (iree-abi-wrap-entry-points) //----- //
module {
  util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
    %2 = util.call @_pad_test(%0, %1) : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
    %3 = hal.tensor.export %2 "output0" : tensor<3x9xi32> -> !hal.buffer_view
    util.return %3 : !hal.buffer_view
  }
  util.func private @_pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
    %extracted = tensor.extract %arg1[] : tensor<i32>
    %padded = tensor.pad %arg0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    util.return %padded : tensor<3x9xi32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func private @_pad_test(%arg0: tensor<2x3xi32>, %arg1: tensor<i32>) -> tensor<3x9xi32> {
  %extracted = tensor.extract %arg1[] : tensor<i32>
  %padded = tensor.pad %arg0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  util.return %padded : tensor<3x9xi32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %2 = util.call @_pad_test(%0, %1) : (tensor<2x3xi32>, tensor<i32>) -> tensor<3x9xi32>
  %3 = hal.tensor.export %2 "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %3 : !hal.buffer_view
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After Inliner (inline) //----- //
module {
  util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
    %extracted = tensor.extract %1[] : tensor<i32>
    %padded = tensor.pad %0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
    util.return %2 : !hal.buffer_view
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After SymbolDCE (symbol-dce) //----- //
module {
  util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
    %extracted = tensor.extract %1[] : tensor<i32>
    %padded = tensor.pad %0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
    util.return %2 : !hal.buffer_view
  }
}


// -----// IR Dump After AssignLegacyTargetDevicesPass (iree-hal-assign-legacy-target-devices) //----- //
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {hal.device.targets = [#device_target_cuda]} {
  util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
    %extracted = tensor.extract %1[] : tensor<i32>
    %padded = tensor.pad %0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
    util.return %2 : !hal.buffer_view
  }
}


// -----// IR Dump After MaterializeTargetDevicesPass (iree-hal-materialize-target-devices) //----- //
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_cuda
  util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
    %extracted = tensor.extract %1[] : tensor<i32>
    %padded = tensor.pad %0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
    util.return %2 : !hal.buffer_view
  }
}


// -----// IR Dump After ResolveDevicePromisesPass (iree-hal-resolve-device-promises) //----- //
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_cuda
  util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
    %extracted = tensor.extract %1[] : tensor<i32>
    %padded = tensor.pad %0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
    util.return %2 : !hal.buffer_view
  }
}


// -----// IR Dump After ResolveDeviceAliasesPass (iree-hal-resolve-device-aliases) //----- //
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_cuda
  util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
    %extracted = tensor.extract %1[] : tensor<i32>
    %padded = tensor.pad %0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
    util.return %2 : !hal.buffer_view
  }
}


// -----// IR Dump After VerifyDevicesPass (iree-hal-verify-devices) //----- //
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_cuda
  util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
    %extracted = tensor.extract %1[] : tensor<i32>
    %padded = tensor.pad %0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
    util.return %2 : !hal.buffer_view
  }
}


// -----// IR Dump After OptimizeIntArithmetic (iree-util-optimize-int-arithmetic) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After LinalgQuantizedConvToConvPass (iree-global-opt-quantized-conv-to-conv) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After LinalgQuantizedMatmulToMatmulPass (iree-global-opt-quantized-matmul-to-matmul) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After CanonicalizerPass (iree-flow-canonicalize) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After RemoveZeroExtentTensorsPass (iree-global-opt-remove-zero-extent-tensors) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After DetachElementwiseFromNamedOpsPass (iree-global-opt-detach-elementwise-from-named-ops) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After LinalgNamedOpConversionPass (linalg-named-op-conversion) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After EraseUnusedLinalgOperandsPass (iree-global-opt-erase-unused-linalg-operands) //----- //
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_cuda
  util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
    %extracted = tensor.extract %1[] : tensor<i32>
    %padded = tensor.pad %0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
    util.return %2 : !hal.buffer_view
  }
}


// -----// IR Dump After ExpandTensorShapesPass (iree-global-opt-expand-tensor-shapes) //----- //
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_cuda
  util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
    %extracted = tensor.extract %1[] : tensor<i32>
    %padded = tensor.pad %0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
    util.return %2 : !hal.buffer_view
  }
}


// -----// IR Dump After ConvertElementwiseToLinalgPass (convert-elementwise-to-linalg) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After RaiseSpecialOpsPass (iree-global-opt-raise-special-ops) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After DecomposeConcatPass (iree-global-opt-decompose-concat) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After GeneralizeLinalgNamedOpsPass (iree-global-opt-generalize-linalg-named-ops) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After FoldUnitExtentDimsPass (iree-dispatch-creation-fold-unit-extent-dims) //----- //
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_cuda
  util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
    %extracted = tensor.extract %1[] : tensor<i32>
    %padded = tensor.pad %0 low[0, 1] high[1, 5] {
    ^bb0(%arg2: index, %arg3: index):
      tensor.yield %extracted : i32
    } : tensor<2x3xi32> to tensor<3x9xi32>
    %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
    util.return %2 : !hal.buffer_view
  }
}


// -----// IR Dump After DemoteContractionInputsToBF16Pass (iree-global-opt-demote-contraction-inputs-to-bf16) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After CanonicalizerPass (iree-flow-canonicalize) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After CanonicalizerPass (iree-flow-canonicalize) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After SetEncodingPass (iree-dispatch-creation-set-encoding) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After MaterializeEncodingIntoNopPass (iree-codegen-materialize-encoding-into-nop) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
  %extracted = tensor.extract %1[] : tensor<i32>
  %padded = tensor.pad %0 low[0, 1] high[1, 5] {
  ^bb0(%arg2: index, %arg3: index):
    tensor.yield %extracted : i32
  } : tensor<2x3xi32> to tensor<3x9xi32>
  %2 = hal.tensor.export %padded "output0" : tensor<3x9xi32> -> !hal.buffer_view
  util.return %2 : !hal.buffer_view
}

// -----// IR Dump After MaterializeHomogeneousEncodingsPass (iree-global-opt-materialize-homogeneous-encodings) //----- //
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_cuda
  util.func public @pad_test(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @pad_test(%input0: tensor<2x3xi32>, %input1: tensor<i32>) -> (%output0: tensor<3x9xi32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<2x3xi32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<i32>
    %extracted = tensor.extract %1[] : tensor<i32>
    %padded = tensor.pad %0 low[0, 1] high[1, 5] {
