// -----// IR Dump After AutoInputConversionPipelinePass (iree-auto-input-conversion) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
module {
  func.func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: tensor<512x128xf16>, %arg1: tensor<128x512xf16>, %arg2: tensor<512x512xf16>) -> tensor<512x512xf16> {
    %0 = linalg.matmul {compilation_info = #compilation} ins(%arg0, %arg1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%arg2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    return %0 : tensor<512x512xf16>
  }
}


// -----// IR Dump After IREEImportPublicPass (iree-import-public) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
module {
  util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: tensor<512x128xf16>, %arg1: tensor<128x512xf16>, %arg2: tensor<512x512xf16>) -> tensor<512x512xf16> {
    %0 = linalg.matmul {compilation_info = #compilation} ins(%arg0, %arg1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%arg2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    util.return %0 : tensor<512x512xf16>
  }
}


// -----// IR Dump After ImportMLProgramPass (iree-import-ml-program) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
module {
  util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: tensor<512x128xf16>, %arg1: tensor<128x512xf16>, %arg2: tensor<512x512xf16>) -> tensor<512x512xf16> {
    %0 = linalg.matmul {compilation_info = #compilation} ins(%arg0, %arg1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%arg2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    util.return %0 : tensor<512x512xf16>
  }
}


// -----// IR Dump After SanitizeModuleNamesPass (iree-sanitize-module-names) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
module {
  util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: tensor<512x128xf16>, %arg1: tensor<128x512xf16>, %arg2: tensor<512x512xf16>) -> tensor<512x512xf16> {
    %0 = linalg.matmul {compilation_info = #compilation} ins(%arg0, %arg1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%arg2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    util.return %0 : tensor<512x512xf16>
  }
}


// -----// IR Dump After ConvertMeshToFlowPass (iree-convert-mesh-to-flow) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
module {
  util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: tensor<512x128xf16>, %arg1: tensor<128x512xf16>, %arg2: tensor<512x512xf16>) -> tensor<512x512xf16> {
    %0 = linalg.matmul {compilation_info = #compilation} ins(%arg0, %arg1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%arg2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    util.return %0 : tensor<512x512xf16>
  }
}


// -----// IR Dump After DemoteF64ToF32Pass (iree-input-conversion-demote-f64-to-f32) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
module {
  util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: tensor<512x128xf16>, %arg1: tensor<128x512xf16>, %arg2: tensor<512x512xf16>) -> tensor<512x512xf16> {
    %0 = linalg.matmul {compilation_info = #compilation} ins(%arg0, %arg1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%arg2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    util.return %0 : tensor<512x512xf16>
  }
}


// -----// IR Dump After mlir::iree_compiler::IREE::ABI::ConvertStreamableOpsPass (iree-abi-convert-streamable-ops) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
module {
  util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: tensor<512x128xf16>, %arg1: tensor<128x512xf16>, %arg2: tensor<512x512xf16>) -> tensor<512x512xf16> {
    %0 = linalg.matmul {compilation_info = #compilation} ins(%arg0, %arg1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%arg2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    util.return %0 : tensor<512x512xf16>
  }
}


// -----// IR Dump After mlir::iree_compiler::IREE::ABI::WrapEntryPointsPass (iree-abi-wrap-entry-points) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
module {
  util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
    %3 = util.call @_matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%0, %1, %2) : (tensor<512x128xf16>, tensor<128x512xf16>, tensor<512x512xf16>) -> tensor<512x512xf16>
    %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
  util.func private @_matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: tensor<512x128xf16>, %arg1: tensor<128x512xf16>, %arg2: tensor<512x512xf16>) -> tensor<512x512xf16> {
    %0 = linalg.matmul {compilation_info = #compilation} ins(%arg0, %arg1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%arg2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    util.return %0 : tensor<512x512xf16>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func private @_matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: tensor<512x128xf16>, %arg1: tensor<128x512xf16>, %arg2: tensor<512x512xf16>) -> tensor<512x512xf16> {
  %0 = linalg.matmul {compilation_info = #iree_codegen.compilation_info<lowering_config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>, translation_info = <pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>>} ins(%arg0, %arg1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%arg2 : tensor<512x512xf16>) -> tensor<512x512xf16>
  util.return %0 : tensor<512x512xf16>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
  %3 = util.call @_matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%0, %1, %2) : (tensor<512x128xf16>, tensor<128x512xf16>, tensor<512x512xf16>) -> tensor<512x512xf16>
  %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
  util.return %4 : !hal.buffer_view
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
  %3 = linalg.matmul {compilation_info = #iree_codegen.compilation_info<lowering_config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>, translation_info = <pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>>} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
  %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
  util.return %4 : !hal.buffer_view
}

// -----// IR Dump After Inliner (inline) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
module {
  util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
    %3 = linalg.matmul {compilation_info = #compilation} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
  %3 = linalg.matmul {compilation_info = #iree_codegen.compilation_info<lowering_config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>, translation_info = <pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>>} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
  %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
  util.return %4 : !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
  %3 = linalg.matmul {compilation_info = #iree_codegen.compilation_info<lowering_config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>, translation_info = <pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>>} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
  %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
  util.return %4 : !hal.buffer_view
}

// -----// IR Dump After SymbolDCE (symbol-dce) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
module {
  util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
    %3 = linalg.matmul {compilation_info = #compilation} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After AssignLegacyTargetDevicesPass (iree-hal-assign-legacy-target-devices) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {hal.device.targets = [#device_target_cuda]} {
  util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
    %3 = linalg.matmul {compilation_info = #compilation} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After MaterializeTargetDevicesPass (iree-hal-materialize-target-devices) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_cuda
  util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
    %3 = linalg.matmul {compilation_info = #compilation} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After ResolveDevicePromisesPass (iree-hal-resolve-device-promises) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_cuda
  util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
    %3 = linalg.matmul {compilation_info = #compilation} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After ResolveDeviceAliasesPass (iree-hal-resolve-device-aliases) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_cuda
  util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
    %3 = linalg.matmul {compilation_info = #compilation} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After VerifyDevicesPass (iree-hal-verify-devices) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_cuda
  util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
    %3 = linalg.matmul {compilation_info = #compilation} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After OptimizeIntArithmetic (iree-util-optimize-int-arithmetic) //----- //
util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
  %3 = linalg.matmul {compilation_info = #iree_codegen.compilation_info<lowering_config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>, translation_info = <pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>>} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
  %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
  util.return %4 : !hal.buffer_view
}

// -----// IR Dump After LinalgQuantizedConvToConvPass (iree-global-opt-quantized-conv-to-conv) //----- //
util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
  %3 = linalg.matmul {compilation_info = #iree_codegen.compilation_info<lowering_config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>, translation_info = <pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>>} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
  %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
  util.return %4 : !hal.buffer_view
}

// -----// IR Dump After LinalgQuantizedMatmulToMatmulPass (iree-global-opt-quantized-matmul-to-matmul) //----- //
util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
  %3 = linalg.matmul {compilation_info = #iree_codegen.compilation_info<lowering_config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>, translation_info = <pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>>} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
  %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
  util.return %4 : !hal.buffer_view
}

// -----// IR Dump After CanonicalizerPass (iree-flow-canonicalize) //----- //
util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
  %3 = linalg.matmul {compilation_info = #iree_codegen.compilation_info<lowering_config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>, translation_info = <pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>>} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
  %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
  util.return %4 : !hal.buffer_view
}

// -----// IR Dump After RemoveZeroExtentTensorsPass (iree-global-opt-remove-zero-extent-tensors) //----- //
util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
  %3 = linalg.matmul {compilation_info = #iree_codegen.compilation_info<lowering_config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>, translation_info = <pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>>} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
  %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
  util.return %4 : !hal.buffer_view
}

// -----// IR Dump After DetachElementwiseFromNamedOpsPass (iree-global-opt-detach-elementwise-from-named-ops) //----- //
util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
  %3 = linalg.matmul {compilation_info = #iree_codegen.compilation_info<lowering_config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>, translation_info = <pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>>} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
  %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
  util.return %4 : !hal.buffer_view
}

// -----// IR Dump After LinalgNamedOpConversionPass (linalg-named-op-conversion) //----- //
util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
  %3 = linalg.matmul {compilation_info = #iree_codegen.compilation_info<lowering_config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>, translation_info = <pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>>} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
  %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
  util.return %4 : !hal.buffer_view
}

// -----// IR Dump After EraseUnusedLinalgOperandsPass (iree-global-opt-erase-unused-linalg-operands) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_cuda
  util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
    %3 = linalg.matmul {compilation_info = #compilation} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After ExpandTensorShapesPass (iree-global-opt-expand-tensor-shapes) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
#device_target_cuda = #hal.device.target<"cuda", [#executable_target_cuda_nvptx_fb]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_cuda
  util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
    %3 = linalg.matmul {compilation_info = #compilation} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
    %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After ConvertElementwiseToLinalgPass (convert-elementwise-to-linalg) //----- //
util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
  %3 = linalg.matmul {compilation_info = #iree_codegen.compilation_info<lowering_config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>, translation_info = <pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>>} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
  %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
  util.return %4 : !hal.buffer_view
}

// -----// IR Dump After RaiseSpecialOpsPass (iree-global-opt-raise-special-ops) //----- //
util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
  %3 = linalg.matmul {compilation_info = #iree_codegen.compilation_info<lowering_config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>, translation_info = <pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>>} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
  %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
  util.return %4 : !hal.buffer_view
}

// -----// IR Dump After DecomposeConcatPass (iree-global-opt-decompose-concat) //----- //
util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
  %3 = linalg.matmul {compilation_info = #iree_codegen.compilation_info<lowering_config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>, translation_info = <pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>>} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
  %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
  util.return %4 : !hal.buffer_view
}

// -----// IR Dump After GeneralizeLinalgNamedOpsPass (iree-global-opt-generalize-linalg-named-ops) //----- //
util.func public @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul_accumulate_512x128xf16_times_128x512xf16_into_512x512xf16_for_LLVMGPUMatmulTensorCore_32_32_16_64_2_1(%input0: tensor<512x128xf16>, %input1: tensor<128x512xf16>, %input2: tensor<512x512xf16>) -> (%output0: tensor<512x512xf16>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<512x128xf16>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<128x512xf16>
  %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<512x512xf16>
  %3 = linalg.matmul {compilation_info = #iree_codegen.compilation_info<lowering_config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>, translation_info = <pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>>} ins(%0, %1 : tensor<512x128xf16>, tensor<128x512xf16>) outs(%2 : tensor<512x512xf16>) -> tensor<512x512xf16>
  %4 = hal.tensor.export %3 "output0" : tensor<512x512xf16> -> !hal.buffer_view
  util.return %4 : !hal.buffer_view
}

// -----// IR Dump After FoldUnitExtentDimsPass (iree-dispatch-creation-fold-unit-extent-dims) //----- //
#config = #iree_codegen.lowering_config<tile_sizes = [[32, 32, 16]]>
#executable_target_cuda_nvptx_fb = #hal.executable.target<"cuda", "cuda-nvptx-fb", {iree.gpu.target = #iree_gpu.target<arch = "sm_86", features = "+ptx76", wgp = <compute =  fp64|fp32|fp16|int64|int32|int16|int8, storage =  b64|b32|b16|b8, subgroup =  shuffle|arithmetic, dot =  dp4xi8toi32, mma = [<WMMA_F32_16x16x16_F16>, <WMMA_F16_16x16x16_F16>], subgroup_size_choices = [32], max_workgroup_sizes = [1024, 1024, 1024], max_thread_count_per_workgroup = 1024, max_workgroup_memory_bytes = 166912, max_workgroup_counts = [2147483647, 65535, 65535]>>}>
#translation = #iree_codegen.translation_info<pipeline = LLVMGPUMatmulTensorCore workgroup_size = [64, 2, 1], {pipeline_depth = 3 : i64, store_stage = 1 : i64}>
#compilation = #iree_codegen.compilation_info<lowering_config = #config, translation_info = #translation>
